// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те,
// що це великий масив, в якому  3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 3){
//     console.log("It`s a big array, which contains 3 and more elements.");
// } else {
//     console.log("It`s a small array, which contains less then 3 elements.");
// }
//--------------------------------------------------------------------------------------------------------------------//
//
// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше).
//     Перевірити, чи знаходиться перше число між двома іншими.
// let array = [1, 2, 3];
//     let min = array[0];
//     let max = array[0];
// for (let i = 0; i < array.length; i++) {
//     if (min > array[i]) {
//         min = array[i];
//     }
//     if (max <  array[i]) {
//         max = array[i];
//     }
// }
// console.log(min);
// console.log(max);
// if (array[0] < array[1] && array[1] < array[2]){
//     console.log(`${array[1]} - In a middle of it all`);
// }
//--------------------------------------------------------------------------------------------------------------------//

//
// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let a = 1, b = 1;
// let res = a + b < 4 ? "Мало" : "Багато";

//--------------------------------------------------------------------------------------------------------------------//
//
// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
//
// let a = -1;
// let res = a < 0 ? "negative" : a === 0 ? "zero" : "positive";
// console.log(res);
//--------------------------------------------------------------------------------------------------------------------//
//
// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
//
// let test = true;
// let res = test ? "Вірно" : "Невірно";
// console.log(res);
//
// test = false;
// res = test ? "Вірно" : "Невірно";
// console.log(res);
//--------------------------------------------------------------------------------------------------------------------//
// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//
// let official = prompt("Яка «офіційна» назва JavaScript?");
// if(official === "ECMAScript"){
//     console.log("Правильно");
//
// }else {
//     console.log("Не знаєте? ECMAScript!");
// }
//--------------------------------------------------------------------------------------------------------------------//
//
//

//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//
//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .